---
kind: other
id: Properties.T:Autodesk.Revit.DB.ForgeTypeId
source: html/3242e0e5-7814-5652-1ae0-037fafc14b5a.htm
---
# ForgeTypeId Properties

Specifies whether the .NET object represents a valid Revit entity.